import Choice

fun main() {
    welcome()
    val firstChoice = Choice("Я попращался с родителями и подошёл к столу регистрации, чтобы узнать, где находиться моя комната, и познакомиться с вожатыми. Ими оказались молодые ребята Регина и Вадик. Рядом со столом кто-то громко смеялся, я обернулся и увидел девочку с чёрными волосами и такими же тёмными глазами, справа от неё стоял мальчик, он был выше милой девочки на пол головы, волосы были ярко рыжими и всё лицо покрывали веснушки. Мальчик так громко заливался хохотом, что на него обратили внимание даже вожатые, которые прежде выглядели абсолютно безразличными. Рядом с шумной компанией одиноко стоял мальчик с пепельно-белыми волосами и такой же белой кожей, он стоял совсем один и ни с кем не разговаривал. Я заколебался… ")
    firstChoice.print()
    val startYourGame = DifferentWays()
    startYourGame.chooseYourWay()
    //different ways
}

fun welcome() {
    println("Это было лето 2021. В том году мне посчастливилось выбить у своих родителей поездку в лагерь вместо типичного визита бабушки на все три месяца. До этого я никогда не ездил в лагеря, поэтому мне было немного боязно, но всё когда-то бывает в первый раз. Я собрался, и родители отвезли меня в лагерь «Лесок». В выборе места я участия не принимал, просто я не знал никаких критериев и полностью доверился родителям.")
    println("Дорога была долгая, и я сильно устал. Приехав туда, я увидел много моих сверстников, внутри всё сжалось. В голове мелькнула мысль: «Зачем я напросился сюда?!» Но я уже был здесь…")
    println("По фасадам зданий стало ясно: этому месту много лет. Но несмотря на обваливающуюся облицовку и ржавеющие качели, всё вокруг было таким ярким и красочным, лица детей светились от счастья.")
}